#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
google_storage_bucket.data-lake-bucket: Refreshing state... [id=dtc-dev-test123-demo-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_storage_bucket.data-lake-bucket will be destroyed
  # (because google_storage_bucket.data-lake-bucket is not in configuration)
  - resource "google_storage_bucket" "data-lake-bucket" {
      - default_event_based_hold    = false -> null
      - force_destroy               = false -> null
      - id                          = "dtc-dev-test123-demo-bucket" -> null
      - labels                      = {} -> null
      - location                    = "US-WEST1" -> null
      - name                        = "dtc-dev-test123-demo-bucket" -> null
      - project                     = "dtc-dataops-dev-366316" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/dtc-dev-test123-demo-bucket" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://dtc-dev-test123-demo-bucket" -> null
    }

  # module.lifecycle_bucket.google_storage_bucket.gcp_bucket will be created
  + resource "google_storage_bucket" "gcp_bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-WEST1"
      + name                        = "dtc-nyc-taxi-dev-dtc-dataops-dev-366316"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = true
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @djcurill, Action: `pull_request`*